agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * Main-thread stack high-water reporting.
 *
 * libopus is compiled with -DVAR_ARRAYS, so every codec scratch buffer is a
 * VLA on this thread's stack; the deepest one (silk_pitch_analysis_core)
 * previously ran the 24 KiB main stack off its PSPLIM guard mid-encode.  There
 * is no way to size the stack honestly without a real high-water number, so
 * report one after each encode.  CONFIG_INIT_STACKS fills the stack with 0xAA
 * at boot and costs no RAM; k_thread_stack_space_get() then counts the bytes
 * still untouched.
 */
static void report_main_stack_headroom(const char *phase)
{
#ifdef CONFIG_INIT_STACKS
	size_t unused = 0U;
	int error = k_thread_stack_space_get(k_current_get(), &unused);

	if (error != 0) {
		printk("Main stack usage (%s): unavailable (%d)\n", phase,
		       error);
		return;
	}
	printk("Main stack usage (%s): peak=%u free=%u size=%u\n", phase,
	       (unsigned int)(CONFIG_MAIN_STACK_SIZE - unused),
	       (unsigned int)unused, (unsigned int)CONFIG_MAIN_STACK_SIZE);
#else
	ARG_UNUSED(phase);
#endif
}

/* PWM duty words: bit 15 clear means the output is low first, so BCLK
 * rises mid-period (tick 4 of 8) while LRCLK edges (tick 0 mod 256) sit
 * on BCLK falling edges, and LRCLK starts low = left slot first.
 * Sequences must live in data RAM for EasyDMA.
 */
static uint16_t mic_bclk_duty[1] __aligned(4) = { MIC_BCLK_TOP / 2U };
static uint16_t mic_lrclk_duty[1] __aligned(4) = { MIC_LRCLK_TOP / 2U };
/* Held while the mic clocks run so PCLK16M is crystal-accurate. */
static struct onoff_manager *mic_hfclk_mgr;
/*
 * DPPI channel for phase-locked PWM starts, allocated through the
 * shared nrfx allocator.  Never hardcode one: the UART console's
 * enhanced poll-out already owns the topmost channel, and disabling
 * someone else's channel wedges that peripheral permanently.
 */
static int mic_dppi_channel = -1;

volatile int audio_cycle_result = -9999;
volatile uint8_t audio_cycle_phase;
volatile uint32_t recorded_samples;
volatile uint16_t recorded_peak;
volatile bool recording_stopped_by_button;
volatile bool sd_ready;
volatile bool recording_on_sd;
volatile int sd_mount_result = -9999;
volatile uint64_t recording_absolute_sum;
volatile bool sd_persistence_verified;
volatile uint32_t sd_boot_count;
volatile int sd_test_read_result = -9999;
volatile int sd_test_write_result = -9999;

static void button_pressed(const struct device *port,
			   struct gpio_callback *callback,
			   gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	k_sem_give(&button_press_sem);
}

/*
 * Debug press hook: a debugger (J-Link) can write 1 here to simulate a
 * button press without touching the hardware —
 *   JLinkExe -device nRF9160_xxAA -if SWD -speed 4000 -autoconnect 1
 *   w4 <&pendant_remote_press> 1
 * Polled wherever the firmware waits on the button.
 */
volatile uint32_t pendant_remote_press;

static bool take_remote_press(void)
{
	if (pendant_remote_press == 0U) {
		return false;
	}
	pendant_remote_press = 0U;
	return true;
}

#ifdef CONFIG_PENDANT_OFFLINE_STORE
static void mark_button_pressed(const struct device *port,
				struct gpio_callback *callback,
				gpio_port_pins_t pins)
{
	ARG_UNUSED(port);
	ARG_UNUSED(callback);
	ARG_UNUSED(pins);
	k_sem_give(&mark_press_sem);
}

/*
 * Same shape as pendant_remote_press: plain volatile globals a J-Link writes
 * over SWD, no protocol on the target.
 *
 *   w4 <&pendant_remote_mark> 1     drop a moment bookmark
 *   w4 <&pendant_remote_offline> 1  take the modem OFFLINE (CFUN=4)
 *   w4 <&pendant_remote_offline> 0  bring it back and reattach
 *
 * pendant_remote_offline is how the offline path is proven without shielding
 * the antenna: it is the only way to make "no usable link" a repeatable
 * condition rather than a story about a lift shaft.
 */
volatile uint32_t pendant_remote_mark;
volatile uint32_t pendant_remote_offline;
static bool link_forced_offline;

static bool take_mark_press(void)
{
	if (k_sem_take(&mark_press_sem, K_NO_WAIT) == 0) {
		return true;
	}
	if (pendant_remote_mark != 0U) {
		pendant_remote_mark = 0U;
		return true;
	}
	return false;
}

/*
 * Apply the debug offline request. Closing the WebSocket first matters: the
 * socket is modem-offloaded, so dropping RF underneath it leaves a
 * descriptor that reports connected and fails every send.
 */
static void apply_forced_link_state(void)
{
	bool want_offline = pendant_remote_offline != 0U;

	if (want_offline == link_forced_offline) {
		return;
	}
	if (want_offline) {
		printk("DEBUG: forcing link offline (store-and-forward test)\n");
		k_mutex_lock(&ws_lock, K_FOREVER);
		pendant_ws_close();
		k_mutex_unlock(&ws_lock);
		pendant_cloud_stream_abort();
		/*
		 * Latch BEFORE powering the radio down: pendant_cloud's
		 * ensure_lte_data_ready() resumes a suspended radio in front
		 * of every socket, so suspending alone lasts exactly until
		 * the next press and the capture would come back online
		 * mid-test.
		 */
		pendant_cloud_block_link(true);
		(void)pendant_cloud_suspend_radio();
		link_forced_offline = true;
	} else {
		printk("DEBUG: restoring link\n");
		pendant_cloud_block_link(false);
		(void)pendant_cloud_resume_radio();
		link_forced_offline = false;
	}
}

static bool link_is_forced_offline(void)
{
	return link_forced_offline;
}
#else
static inline void apply_forced_link_state(void) {}
static inline bool link_is_forced_offline(void)
{
	return false;
}
static inline bool take_mark_press(void)
{
	return false;
}
#endif /* CONFIG_PENDANT_OFFLINE_STORE */

/*
 * Button 2 double-press gesture detector (reflex trigger).
 *
 * The single press stays a bookmark, and the header's original argument
 * for button 2 still holds: never make the COMMON action wait for gesture
 * disambiguation.  So the 600 ms second-press window opens ONLY while a
 * gesture recipe is actually armed — with none armed this returns
 * immediately and the bookmark costs exactly what it always cost.  With
 * one armed, the bookmark is delayed by at most the detection window,
 * which is the documented ceiling for this trade.
 *
 * Returns true when a second press landed inside the window (the caller
 * fires the gesture recipes instead of bookmarking).  Edges within the
 * first 100 ms are switch bounce of the SAME press, not a human double —
 * counting them would turn every scratchy contact into a gesture.
 */
#define MARK_GESTURE_WINDOW_MS 600
#define MARK_GESTURE_DEBOUNCE_MS 100

static bool reflex_mark_double_press(void)
{
	int64_t opened_at;

	if (!pendant_reflex_gesture_armed()) {
		return false;
	}
	opened_at = k_uptime_get();
	while (k_uptime_get() - opened_at < MARK_GESTURE_WINDOW_MS) {
		k_msleep(10);
		if (take_mark_press()) {
			if (k_uptime_get() - opened_at <
			    MARK_GESTURE_DEBOUNCE_MS) {
				continue;
			}
			printk("Button 2 double-press gesture (%d ms apart)\n",
			       (int)(k_uptime_get() - opened_at));
			return true;
		}
	}
	return false;
}

