agenticaiuw/hivemind/firmware/nrf9160/src/main.c
		if (error == 0) {
			error = close_error;
		}
	}
	if (error != 0 && started) {
		(void)i2s_trigger(i2s, I2S_DIR_TX, I2S_TRIGGER_DROP);
	}
	return error;
}

/*
 * Conversational autoplay: pull the model's spoken PCM off the upload socket
 * (pendant_cloud_reply_read) and drive I2S as it arrives. An I2S underrun
 * during an LTE stall is recovered by a full reconfigure + preamble — the
 * ESP32 resyncs on the preamble pattern, so a stall is a glitch, not a brick.
 */
/* Pauses are clean rebuffers now (silence, not noise) — allow more. */
#define INLINE_REPLY_MAX_RECOVERIES 12U

/* ~500 ms of 8 kHz u-law buffered before the speaker starts. When the
 * downlink proves slower than the stream rate, each starvation raises the
 * refill bar so the reply degrades into ONE longer pause, not stutter. */
#define INLINE_PREBUFFER_BYTES 4000U
#define INLINE_REBUFFER_STEP_BYTES 8000U
/* Opus wire is ~2 KB/s: ~5 packets ≈ 300 ms to start, +~600 ms per pause. */
#define INLINE_OPUS_PREBUFFER_BYTES 512U
#define INLINE_OPUS_REBUFFER_STEP 1024U
#define INLINE_OPUS_MAX_PACKET_BYTES 1275U

/*
 * Pop one complete [u16 BE length][packet] from the wire ring and decode to
 * 24 kHz mono PCM. Returns samples produced, 0 when the ring lacks a full
 * packet, <0 on protocol or decoder error.
 */
static int inline_opus_next_packet(uint8_t *ring, size_t capacity,
				   size_t *tail, size_t *count,
				   int16_t *pcm_out)
{
	static uint8_t packet[INLINE_OPUS_MAX_PACKET_BYTES];
	size_t length;

	if (*count < 2U) {
		return 0;
	}
	length = ((size_t)ring[*tail] << 8) |
		 ring[(*tail + 1U) % capacity];
	if (length == 0U || length > sizeof(packet)) {
		return -EBADMSG;
	}
	if (*count < 2U + length) {
		return 0;
	}
	*tail = (*tail + 2U) % capacity;
	for (size_t i = 0U; i < length; ++i) {
		packet[i] = ring[(*tail + i) % capacity];
	}
	*tail = (*tail + length) % capacity;
	*count -= 2U + length;
	return pendant_opus_reply_decode_packet(
		packet, length, pcm_out, PENDANT_OPUS_REPLY_FRAME_SAMPLES);
}

static int play_inline_reply(const struct device *i2s)
{
	const bool ulaw_reply =
		pendant_cloud_reply_format == PENDANT_CLOUD_AUDIO_G711_ULAW;
	const bool opus_reply =
		pendant_cloud_reply_format == PENDANT_CLOUD_AUDIO_OPUS_FRAMES;
	const uint32_t reply_rate = pendant_cloud_reply_sample_rate != 0U
					    ? pendant_cloud_reply_sample_rate
					    : PENDANT_CLOUD_REPLY_SAMPLE_RATE;
	struct i2s_config config = {
		.word_size = 16U,
		.channels = I2S_CHANNEL_COUNT,
		.format = I2S_FMT_DATA_FORMAT_I2S,
		.options = I2S_OPT_FRAME_CLK_CONTROLLER |
			   I2S_OPT_BIT_CLK_CONTROLLER,
		/* Opus decodes straight to 24 kHz; u-law is upsampled 3x on
		 * decode (8 -> 24 kHz). Either way the ESP32 bridge sees the
		 * 24000 Hz its resampler is hardcoded for. */
		.frame_clk_freq = ulaw_reply ? reply_rate * 3U : reply_rate,
		.mem_slab = &i2s_slab,
		.block_size = I2S_BLOCK_SIZE,
		.timeout = 3000,
	};
	uint32_t recoveries = 0U;
	uint32_t played_samples = 0U;
	uint32_t queued_blocks = 0U;
	uint32_t rebuffer_waits = 0U;
	bool started = false;
	bool configured = false;
	int read_result = 0;
	int error = 0;

	if (!ulaw_reply && !opus_reply) {
		/* Legacy 24 kHz PCM path (kept for relay fallback). */
		int16_t mono[I2S_BLOCK_FRAMES];

		for (;;) {
			read_result =
				pendant_cloud_reply_read(mono, sizeof(mono));
			if (read_result <= 0) {
				break;
			}
			if ((read_result & 1) != 0) {
				--read_result;
				if (read_result == 0) {
					break;
				}
			}

			size_t frames = (size_t)read_result / sizeof(int16_t);
			void *block;
			int16_t *output;

			if (!configured) {
				error = i2s_configure(i2s, I2S_DIR_TX, &config);
				if (error == 0) {
					error = queue_i2s_stream_preamble(i2s);
				}
				if (error != 0) {
					break;
				}
				configured = true;
				started = false;
				queued_blocks = I2S_SYNC_PATTERN_BLOCKS + 1U;
			}
			error = k_mem_slab_alloc(&i2s_slab, &block, K_MSEC(3000));
			if (error != 0) {
				break;
			}
			output = block;
			for (size_t frame = 0U; frame < frames; ++frame) {
				output[2U * frame] = mono[frame];
				output[2U * frame + 1U] = mono[frame];
			}
			for (size_t frame = frames; frame < I2S_BLOCK_FRAMES;
			     ++frame) {
				output[2U * frame] = 0;
				output[2U * frame + 1U] = 0;
			}
			error = i2s_write(i2s, block, I2S_BLOCK_SIZE);
			if (error != 0) {
				k_mem_slab_free(&i2s_slab, block);
				if (++recoveries > INLINE_REPLY_MAX_RECOVERIES) {
					break;
				}
				printk("Inline reply I2S recovery %u (error %d)\n",
				       recoveries, error);
				(void)i2s_trigger(i2s, I2S_DIR_TX,
						  I2S_TRIGGER_DROP);
				configured = false;
				error = 0;
				continue;
			}
			played_samples += (uint32_t)frames;
			++queued_blocks;
			if (!started && queued_blocks >= I2S_PREFILL_BLOCKS) {
				error = i2s_trigger(i2s, I2S_DIR_TX,
						    I2S_TRIGGER_START);
				if (error != 0) {
					break;
				}
				started = true;
			}
		}
		goto teardown;
	}

	/*
	 * Streamed reply (Opus packets or u-law bytes) with a workspace jitter
	 * ring: LTE delivers in bursts with multi-second gaps, far larger than
	 * the 4-block (~43 ms) I2S queue. Prebuffer, then absorb; genuine
	 * starvation pauses cleanly and rebuffers with an escalating floor.
	 */
	{
		uint8_t *ring = audio_workspace;
		size_t ring_capacity = sizeof(audio_workspace);
		size_t ring_tail = 0U;
		size_t ring_head = 0U;
		size_t ring_count = 0U;
		/* Decoded-PCM staging: Opus emits 60 ms bursts (1440 samples
		 * at 24 kHz); u-law interpolation carries 3 at a time. */
		static int16_t pending_pcm[PENDANT_OPUS_REPLY_FRAME_SAMPLES];
		size_t pending_length = 0U;
		size_t pending_offset = 0U;
		int16_t previous_sample = 0;
		size_t prebuffer_bytes =
			opus_reply ? INLINE_OPUS_PREBUFFER_BYTES
				   : INLINE_PREBUFFER_BYTES;
		bool reply_eof = false;
		int stream_error = 0;

		if (opus_reply) {
			int decoder_bytes = pendant_opus_reply_decoder_begin(
				audio_workspace, sizeof(audio_workspace));

			if (decoder_bytes < 0) {
				error = decoder_bytes;
				goto teardown;
			}
			ring = audio_workspace +
			       ROUND_UP((size_t)decoder_bytes, 4U);
			ring_capacity = sizeof(audio_workspace) -
					ROUND_UP((size_t)decoder_bytes, 4U);
		}

		(void)pendant_cloud_reply_set_nonblocking(true);

