agenticaiuw/hivemind/firmware/nrf9160/src/main.c
/*
 * One press-to-press conversation: mic streams up, agent speech streams
 * down and PLAYS WHILE RECORDING — the model decides when to talk. Ends on
 * the second button press, relay 'end' (30 s of mutual silence), transport
 * death, or the runaway cap.
 */
/*
 * Tell the relay a conversation is starting and let the uplink flow.
 *
 * Split out of run_conversation so the local-command path can DEFER it:
 * this function contains the first byte this device transmits for a press,
 * and the whole point of on-device matching is to be able to never call it.
 * Everything before it — mic, I2S, Opus encode, the FIFO — is local work
 * that costs no radio.
 */
static int convo_open_uplink(char *device_time, size_t device_time_capacity)
{
	char start_message[96];
	int error;

	k_mutex_lock(&ws_lock, K_FOREVER);
	error = pendant_ws_connect();
	if (error == 0) {
		pendant_cloud_copy_device_time(device_time,
					       device_time_capacity);
		snprintf(start_message, sizeof(start_message),
			 "{\"type\":\"start\",\"deviceTime\":\"%s\"}",
			 device_time);
		error = pendant_ws_send_text(start_message);
	}
	k_mutex_unlock(&ws_lock);
	if (error == 0) {
		/* Release the held packets. The WS thread flushes them on its
		 * next pass, oldest first, so the relay hears the utterance
		 * from its true beginning. */
		atomic_set(&convo_uplink_gate, 1);
	}
	return error;
}

static int run_conversation(const struct device *i2s)
{
	struct i2s_config config = {
		.word_size = 24U,
		.channels = 1U,
		.format = I2S_FMT_DATA_FORMAT_I2S,
		.options = I2S_OPT_BIT_CLK_TARGET | I2S_OPT_FRAME_CLK_TARGET,
		.frame_clk_freq = MIC_FRAME_RATE,
		.mem_slab = &mic_rx_slab,
		.block_size = MIC_RX_BLOCK_SIZE,
		.timeout = 1500,
	};
	struct i2s_config tx_config;
	int32_t raw_processing[MIC_RX_BLOCK_FRAMES];
	char device_time[32];
	/*
	 * Has this press been allowed to transmit yet? Without local
	 * commands the answer is "before the mic even started", exactly as
	 * before. With them, it stays false until the matcher gives up on
	 * the utterance being one of the enrolled words.
	 */
	bool uplink_open = false;
#ifdef CONFIG_PENDANT_LOCAL_COMMANDS
	/* Slot to hand the reflex layer once I2S is torn down; 0 = none. */
	uint8_t local_fire_slot = 0U;
	bool local_handled = false;
	enum pendant_local_verdict local_verdict = PENDANT_LOCAL_PENDING;
#endif
	int64_t started_at;
	int64_t next_led_toggle;
	size_t stage_frames = 0U;
	size_t block_index = 0U;
	int32_t hpf_prev_in = 0;
	int32_t hpf_prev_out = 0;
	bool hpf_primed = false;
	int32_t slew_prev = 0;
	bool slew_primed = false;
	bool playing = false;
	bool i2s_running = false;
	bool stop_sent = false;
	int result = 0;
	int error;

	live_stream_failed = false;
	live_tx_saturated = false;
	live_fifo_reset();
	dl_jitter_reset();
	tx_resample_reset();
	k_msgq_purge(&dl_frames);
	atomic_set(&convo_flush_req, 0);
	atomic_set(&convo_end_req, 0);
	atomic_set(&convo_started, 0);
	convo_tx_blocks = 0U;
	convo_tx_starved = 0U;
	convo_tx_dry = false;
	convo_rx_blocks = 0U;
	convo_decoded_packets = 0U;
	convo_max_loop_ms = 0U;
	convo_uplink_drops = 0U;
	convo_mic_drops = 0U;
	convo_tx_peak = 0U;
#ifdef CONFIG_PENDANT_MIC_INJECT
	/* Per-conversation, like every other counter here. Head/tail are
	 * deliberately untouched: the host prefills the ring before pressing,
	 * and resetting the indices here would throw that prefill away. */
	pendant_inject_frames = 0U;
	pendant_inject_underruns = 0U;
#endif
	convo_uplink_ducked = false;
	convo_uplink_holding = false;
	convo_dl_active_until = 0;
	convo_adapt_last_ms = 0;
	convo_uplink_duck_ms = 0U;
	convo_uplink_held = 0U;
	convo_decode_cycles = 0U;
	convo_decode_calls = 0U;
	convo_decode_max_cycles = 0U;
	convo_encode_cycles = 0U;
	convo_encode_calls = 0U;
	convo_encode_max_cycles = 0U;

#ifdef CONFIG_PENDANT_LOCAL_COMMANDS
	/*
	 * Say nothing yet. The mic, the encoder and the FIFO all start below
	 * exactly as they always did; only the radio waits, and only for as
	 * long as it takes to rule the utterance out as a command word.
	 *
	 * An enrollment press never opens the uplink at all — the owner is
	 * teaching the device a word, not asking a model about it.
	 */
	atomic_set(&convo_uplink_gate, 0);
	pendant_local_begin();
#else
	atomic_set(&convo_uplink_gate, 1);
	error = convo_open_uplink(device_time, sizeof(device_time));
	if (error != 0) {
		return error;
	}
	uplink_open = true;
#endif

	error = pendant_opus_stream_begin_packets(SAMPLE_RATE,
						  audio_workspace,
						  OPUS_TX_ARENA_BYTES,
						  live_opus_packet_sink);
	if (error != 0) {
		printk("Conversation encoder init failed: %d\n", error);
		return error;
	}
	error = pendant_opus_reply_decoder_begin_rate(
		opus_dec_arena, sizeof(opus_dec_arena),
		PENDANT_OPUS_REPLY_SAMPLE_RATE);
	if (error < 0) {
		printk("Conversation decoder init failed: %d\n", error);
		pendant_opus_stream_abort();
		return error;
	}

	error = k_mem_slab_init(&mic_rx_slab, mic_rx_storage,
				MIC_RX_BLOCK_SIZE, MIC_RX_BLOCK_COUNT);
	if (error != 0) {
		goto teardown;
	}

	gpio_pin_set_dt(&led, 1);
	next_led_toggle = k_uptime_get() + 250;
	mic_clocks_start();

	error = i2s_configure(i2s, I2S_DIR_RX, &config);
	if (error != 0) {
		goto teardown_clocks;
	}
	tx_config = config;
	tx_config.mem_slab = &convo_tx_slab;
	/*
	 * TX writes must NEVER block. i2s_write waits up to cfg.timeout for
	 * a free tx_queue slot, which paces the loop to exactly one RX block
	 * per block period — leaving no way to drain an RX backlog after a
	 * stall, so the backlog grows until the RX queue overflows and the
	 * driver errors the transfer (observed as -EIO at ~15 s). With 0 the
	 * top-up simply stops when the runway is full and the loop is free
	 * to catch up. RX keeps its own timeout for i2s_read.
	 */
	tx_config.timeout = 0;
	error = i2s_configure(i2s, I2S_DIR_TX, &tx_config);
	if (error != 0) {
		goto teardown_clocks;
	}

	/* START in BOTH mode needs TX blocks queued first. */
	error = convo_queue_preamble(i2s);
	if (error != 0) {
		goto teardown_clocks;
	}

