agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	k_msleep(MIC_POWERUP_BUDGET_MS);
	printk("Conversation: duplex I2S bclk_hz=%u lrclk_hz=%u "
	       "(mic %u Hz up, agent 24 kHz down)\n",
	       16000000U / MIC_BCLK_TOP, 16000000U / MIC_LRCLK_TOP,
	       SAMPLE_RATE);
	error = i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_START);
	if (error != 0) {
		goto teardown_clocks;
	}
	i2s_running = true;
	started_at = k_uptime_get();
	clear_button_events();
	k_msgq_purge(&mic_raw_q);
	atomic_set(&audio_thread_error, 0);
	/* Hand the I2S deadlines to the audio thread from here on. */
	audio_i2s_dev = i2s;
	atomic_set(&convo_active, 1);

	while (true) {
		void *block;
		int64_t loop_started;

		/*
		 * Codec-side loop. The audio thread owns every I2S deadline;
		 * this one may take as long as an Opus frame needs without
		 * endangering the transfer. A missed block here costs mic
		 * audio (counted as mic_drops), never the conversation.
		 */
		if (k_msgq_get(&mic_raw_q, &block, K_MSEC(200)) != 0) {
			if (atomic_get(&convo_end_req) ||
			    !atomic_get(&convo_active)) {
				break;
			}
			continue;
		}
		loop_started = k_uptime_get();
		memcpy(raw_processing, block, MIC_RX_BLOCK_SIZE);
		k_mem_slab_free(&mic_rx_slab, block);

		size_t size = MIC_RX_BLOCK_SIZE;

		if (block_index < MIC_STARTUP_SKIP_BLOCKS) {
			++block_index;
			clear_button_events();
			continue;
		}
		++block_index;

		/* Decide duck/hold for THIS block before any of it is encoded. */
		convo_update_uplink_adapt();

		/* Mic DSP — the twin of record_microphone's inner loop
		 * (slew limit → decimate-average → DC blocker → gain). */
		int32_t *raw = raw_processing;
		size_t out_frames = (size / sizeof(int32_t)) / MIC_DECIMATION;

		for (size_t frame = 0U; frame < out_frames; ++frame) {
			int32_t first = raw[frame * MIC_DECIMATION] >>
					MIC_SAMPLE_SHIFT;
			int32_t second = raw[frame * MIC_DECIMATION + 1U] >>
					 MIC_SAMPLE_SHIFT;

			if (!slew_primed) {
				slew_prev = first;
				slew_primed = true;
			}
			int32_t delta = first - slew_prev;

			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			first = slew_prev;
			delta = second - slew_prev;
			delta = CLAMP(delta, -MIC_SLEW_LIMIT, MIC_SLEW_LIMIT);
			slew_prev += delta;
			second = slew_prev;

			int32_t sample = ((first + second) / 2) >> 8;

			if (!hpf_primed) {
				hpf_prev_in = sample;
				hpf_primed = true;
			}
			int32_t filtered =
				sample - hpf_prev_in +
				(int32_t)(((int64_t)MIC_HPF_COEFF_Q15 *
					   hpf_prev_out) >>
					  15);
			hpf_prev_in = sample;
			hpf_prev_out = filtered;

			int32_t amplified = filtered * MIC_GAIN;

			amplified = CLAMP(amplified, INT16_MIN, INT16_MAX);
			mic_stage_samples[stage_frames] = (int16_t)amplified;
			if (++stage_frames == MIC_STAGE_FRAMES) {
				/* Harness builds only, and only while armed:
				 * swap the mic's stage for injected PCM before
				 * the encoder ever sees it. */
				(void)pendant_inject_fill_stage(
					mic_stage_samples, MIC_STAGE_FRAMES);
				live_tx_offer_stage(mic_stage_samples,
						    MIC_STAGE_FRAMES);
#ifdef CONFIG_PENDANT_LOCAL_COMMANDS
				/*
				 * Same buffer the encoder just saw, so the
				 * matcher hears exactly what the relay would
				 * have. Only while the verdict is open: once
				 * the uplink is flowing this is a normal
				 * conversation and the filterbank would be
				 * pure cost on a loop that has none to spare.
				 */
				if (!uplink_open) {
					local_verdict =
						pendant_local_offer_stage(
							mic_stage_samples,
							MIC_STAGE_FRAMES);
				}
#endif
				stage_frames = 0U;
			}
		}
		if (live_stream_failed) {
			result = -EIO;
			break;
		}

#ifdef CONFIG_PENDANT_LOCAL_COMMANDS
		/*
		 * Act on the verdict OUT here, never inside the sample loop:
		 * opening the uplink sends a WebSocket text frame, and a
		 * blocking socket write has no business between two audio
		 * samples.
		 */
		if (!uplink_open && local_verdict != PENDANT_LOCAL_PENDING) {
			uint8_t slot = pendant_local_matched_slot();

			if (local_verdict == PENDANT_LOCAL_MATCH &&
			    (slot == 0U ||
			     pendant_reflex_voice_armed(slot))) {
				/*
				 * Done, and the modem never transmitted. slot
				 * 0 is the enrollment press: the word was
				 * stored, there is no recipe to run, and
				 * shipping it to a model would answer a
				 * question the owner did not ask.
				 */
				local_handled = true;
				local_fire_slot = slot;
				printk("LOCAL handled press on-device "
				       "(slot=%u) — no LTE session\n",
				       slot);
				break;
			}
			if (local_verdict == PENDANT_LOCAL_MATCH) {
				/*
				 * The word was recognized but nothing is
				 * bound to it. Swallowing the press here
				 * would leave the owner talking to a device
				 * that silently did nothing, which is worse
				 * than a cloud round trip.
				 */
				printk("LOCAL slot %u matched but no armed "
				       "recipe — falling through to cloud\n",
				       slot);
			}
			error = convo_open_uplink(device_time,
						  sizeof(device_time));
			if (error != 0) {
				printk("Conversation uplink open failed after "
				       "local decision: %d\n",
				       error);
				result = error;
				break;
			}
			uplink_open = true;
			error = 0;
		}
#endif

		/* The WS thread moves bytes; this loop only decodes. The
		 * audio thread owns playback state and barge-in flushes. */
		convo_decode_downlink();

		if (atomic_get(&convo_end_req)) {
			/* Relay 'end' (mutual silence) or transport close —
			 * a normal conversation ending, not a failure. */
			printk("Conversation ended by relay/transport\n");
			error = 0;
			break;
		}

		/* Solid LED while agent audio is buffered, blink otherwise. */
		if (dl_jitter_fill() > 0U) {
			gpio_pin_set_dt(&led, 1);
			next_led_toggle = k_uptime_get() + 250;
		} else if (k_uptime_get() >= next_led_toggle) {
			gpio_pin_toggle_dt(&led);
			next_led_toggle = k_uptime_get() + 250;
		}

		if (k_uptime_get() - started_at >
		    (int64_t)CONVO_MAX_SECONDS * 1000) {
			printk("Conversation hit the %u s cap\n",
			       CONVO_MAX_SECONDS);
			break;
		}
#if PENDANT_BOOT_CONVERSATION_TEST
		if (k_uptime_get() - started_at >
		    (int64_t)PENDANT_BOOT_CONVERSATION_SECONDS * 1000) {
			printk("Self-test conversation window elapsed\n");
			break;
		}
#endif
		/* Bounce/release edges from the starting press for the first
		 * second; after that a press ends the conversation. */
		if (k_uptime_get() - started_at < 1000) {
			clear_button_events();
		} else if (k_sem_take(&button_press_sem, K_NO_WAIT) == 0 ||
			   take_remote_press()) {
			printk("Conversation ended by button\n");
			break;
		}

