agenticaiuw/hivemind/firmware/nrf9160/src/main.c
		/* Loop time is the whole ballgame: exceed the TX runway and
		 * the driver kills the duplex transfer. Track the worst. */
		uint32_t loop_ms = (uint32_t)(k_uptime_get() - loop_started);

		if (loop_ms > convo_max_loop_ms) {
			convo_max_loop_ms = loop_ms;
		}
	}

	/* Stop the audio thread before touching I2S or the slabs. */
	atomic_set(&convo_active, 0);
	/* Never leave the legacy record path gated by a conversation's hold. */
	convo_uplink_holding = false;
#ifdef CONFIG_PENDANT_MIC_INJECT
	/*
	 * Injection is scoped to one conversation, and disarming here is the
	 * safety net for a host that died mid-run. An armed ring nobody is
	 * feeding does not fail loudly — it silently replaces the microphone
	 * with silence, so the owner's next press would record nothing and
	 * look like broken hardware. Bounding that to the conversation it was
	 * armed for keeps a debug tool from becoming a latent product fault.
	 */
	pendant_inject_arm = 0U;
#endif
	k_msleep(30);
	if (result == 0 && atomic_get(&audio_thread_error) != 0) {
		result = (int)atomic_get(&audio_thread_error);
	}
	{
		void *stale;

		while (k_msgq_get(&mic_raw_q, &stale, K_NO_WAIT) == 0) {
			k_mem_slab_free(&mic_rx_slab, stale);
		}
	}

	printk("Conversation stats: rx_blocks=%u tx_blocks=%u tx_starved=%u "
	       "decoded_packets=%u max_loop_ms=%u fifo_left=%u "
	       "uplink_drops=%u mic_drops=%u tx_peak=%u "
	       "duck_ms=%u uplink_held=%u" PENDANT_INJECT_STATS_FMT
	       PENDANT_STORE_STATS_FMT "\n",
	       convo_rx_blocks, convo_tx_blocks, convo_tx_starved,
	       convo_decoded_packets, convo_max_loop_ms,
	       (uint32_t)live_fifo_fill(), convo_uplink_drops,
	       convo_mic_drops, convo_tx_peak, convo_uplink_duck_ms,
	       convo_uplink_held PENDANT_INJECT_STATS_ARGS
		       PENDANT_STORE_STATS_ARGS);
	printk("Codec cost: decode avg=%u us max=%u us n=%u | "
	       "encode avg=%u us max=%u us n=%u\n",
	       convo_decode_calls
		       ? cycles_to_us(convo_decode_cycles / convo_decode_calls)
		       : 0U,
	       cycles_to_us(convo_decode_max_cycles), convo_decode_calls,
	       convo_encode_calls
		       ? cycles_to_us(convo_encode_cycles / convo_encode_calls)
		       : 0U,
	       cycles_to_us(convo_encode_max_cycles), convo_encode_calls);

teardown_clocks:
	if (i2s_running) {
		/*
		 * DROP, never DRAIN: as a clock-slave, draining needs the PWM
		 * clocks to keep running until every queued TX block plays
		 * out — a 12 ms settle is not enough, and killing the clocks
		 * mid-STOPPING wedges i2s_nrfx (configure then fails -EINVAL
		 * until reboot; review finding). DROP forces READY
		 * synchronously and frees the queued blocks; the ≤41 ms of
		 * tail audio it discards is silence or flushed speech.
		 */
		(void)i2s_trigger(i2s, I2S_DIR_BOTH, I2S_TRIGGER_DROP);
		k_msleep(MIC_STOP_SETTLE_MS);
	}
	mic_clocks_stop();
	gpio_pin_set_dt(&led, 0);
teardown:
	atomic_set(&convo_active, 0);
	/* Whatever happens next, the gate belongs to the NEXT press. */
	atomic_set(&convo_uplink_gate, 0);
	k_mutex_lock(&ws_lock, K_FOREVER);
	/*
	 * Only a conversation the relay was told about needs telling it is
	 * over. A press answered on-device was never announced, so a "stop"
	 * here would be this device's only transmission for that press —
	 * spending the radio to report that it did not need the radio.
	 */
	if (uplink_open && pendant_ws_connected() && !stop_sent) {
		(void)pendant_ws_send_text("{\"type\":\"stop\"}");
		stop_sent = true;
	}
	k_mutex_unlock(&ws_lock);
	pendant_opus_stream_abort();
	pendant_opus_reply_decoder_end();
	clear_button_events();
#ifdef CONFIG_PENDANT_LOCAL_COMMANDS
#ifdef CONFIG_PENDANT_LOCAL_TRACE
	pendant_local_report();
#endif
	/*
	 * Run the recipe LAST, after I2S is torn down and convo_active is
	 * clear: a chime action reconfigures the same peripheral and
	 * reflex_chime_play refuses (-EBUSY) while a conversation is live.
	 * By here the DROP has completed and the clocks are stopped, so the
	 * chime path owns the bus exactly as it does from the idle loop.
	 */
	if (local_handled && local_fire_slot != 0U) {
		unsigned int fired =
			pendant_reflex_fire_voice(local_fire_slot);

		printk("LOCAL fired %u recipe(s) for slot %u with the radio "
		       "untouched\n",
		       fired, local_fire_slot);
		result = 0;
	} else if (local_handled) {
		/* Enrollment press: the template is stored and saved. */
		flash_led(2U, 80, 120);
		result = 0;
	}
#endif
	if (result == 0 && error != 0) {
		result = error;
	}
	return result;
}

int main(void)
{
	const struct device *const i2s = DEVICE_DT_GET(I2S_NODE);
	int error;

	if (!gpio_is_ready_dt(&led)) {
		audio_cycle_result = -ENODEV;
		return 0;
	}
	error = gpio_pin_configure_dt(&led, GPIO_OUTPUT_INACTIVE);
	if (error != 0) {
		audio_cycle_result = error;
		return 0;
	}
	if (!gpio_is_ready_dt(&button)) {
		audio_cycle_result = -ENODEV;
		show_error();
	}
	error = gpio_pin_configure_dt(&button, GPIO_INPUT);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	gpio_init_callback(&button_callback, button_pressed, BIT(button.pin));
	error = gpio_add_callback(button.port, &button_callback);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	error = gpio_pin_interrupt_configure_dt(&button, GPIO_INT_EDGE_TO_ACTIVE);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
#ifdef CONFIG_PENDANT_OFFLINE_STORE
	/*
	 * Button 2 is a convenience, not a dependency: if it fails to
	 * configure, log it and keep going. Losing bookmarks is bad; refusing
	 * to boot a voice pendant over a spare button is worse.
	 */
	if (gpio_is_ready_dt(&mark_button) &&
	    gpio_pin_configure_dt(&mark_button, GPIO_INPUT) == 0) {
		gpio_init_callback(&mark_button_callback, mark_button_pressed,
				   BIT(mark_button.pin));
		if (gpio_add_callback(mark_button.port,
				      &mark_button_callback) != 0 ||
		    gpio_pin_interrupt_configure_dt(
			    &mark_button, GPIO_INT_EDGE_TO_ACTIVE) != 0) {
			printk("Bookmark button unavailable — use "
			       "pendant_remote_mark\n");
		}
	} else {
		printk("Bookmark button not present on this board\n");
	}
#endif
	if (!device_is_ready(i2s)) {
		audio_cycle_result = -ENODEV;
		show_error();
	}

	if (mount_sd_card() == 0 && test_sd_persistence() != 0) {
		sd_ready = false;
	}
	if (!sd_ready) {
		printk("microSD is required for Internet voice upload\n");
		audio_cycle_result = sd_mount_result;
		show_error();
	}

